app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 5]]
---
	def index
    	@articles = Article.order("RANDOM()").limit(5).all

INSERT INTO "articles" ("name", "content", "in_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "sdfssdf"], ["content", "sdfsdf"], ["in_date", "2018-10-29 09:04:00"], ["created_at", "2018-10-29 09:05:10.338683"], ["updated_at", "2018-10-29 09:05:10.338683"]]
---
	def create
	  @article = Article.new(article_params)

	  if @article.save